material.org
#+title: Material
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="myStyle.css" />
#+OPTIONS: html-style:nil H:1 toc:1 num:nil
#+HTML_LINK_HOME: index.html
* Assignments
1. [[file:Assignments/1-Assignment/hw1.org][html]]
2. [[file:Assignments/2-Assignment/hw2.org][html]]
3. [[file:Assignments/3-Assignment/hw3.org][html]]
4. [[file:Assignments/4-Assignment/hw4.org][html]]
5. [[file:Assignments/5-Assignment/hw5.org][html]]
6. [[file:Assignments/6-Assignment/hw6.org][html]]
7. [[file:Assignments/7-Assignment/hw7.org][html]] [[file:Assignments/7-Assignment/assign7.zip][assign7.zip]]
* Lectures
** Course Introduction
*** [[file:Slides/01-course-introduction.pdf][pdf]] [[file:Code/01/swap.c][swap.c]] [[file:Code/01/swap.rs][swap.rs]]
** The Basics
*** [[file:Slides/02-the-basics.pdf][pdf]] [[file:Slides/02-the-basics-392-annot.pdf][pdf (annotated)]]
** The Stack and Heap
*** [[file:Slides/03-stack-and-heap.pdf][pdf]] [[file:Slides/03-stack-and-heap-annot.pdf][pdf (annotated)]]
** References and Borrowing
*** [[file:Slides/04-references-borrowing.pdf][pdf]]
** Structures and Enumerations
*** [[file:Slides/05-structs-enums.pdf][pdf]]
** Collections
*** [[file:Slides/06-collections.pdf][pdf]]
** Traits
*** [[file:Slides/07-traits.pdf][pdf]]
** Closures and Iterators
*** [[file:Slides/08-closures.pdf][pdf]]
** Lifetimes
*** [[file:Slides/09-lifetimes.pdf][pdf]]
** Boxes and Recursive Data
*** [[file:Slides/10-boxes.pdf][pdf]]
** Reference Counting and Internal Mutability
*** [[file:Slides/11-refs.pdf][pdf]]
** Concurrency
*** [[file:Slides/12-concurrency.pdf][pdf]]
** Primer on Proof/Type Theory
*** [[file:Slides/13-proof-theory.pdf][pdf]] [[file:Slides/13-proof-theory-annotated.pdf][pdf (annotated)]]
** Substructural Proof/Type Theory
*** [[file:Slides/14-linear-types.pdf][pdf]] [[file:Slides/14-linear-types-annotated.pdf][pdf (annotated)]]
** Workshop: LTLC Interpreter
*** [[file:Slides/15-stlc-workshop.pdf][pdf]] [[file:Code/ltlc.zip][ltlc.zip]]
** Featherweight Rust: An Introduction
*** [[file:Slides/16-fr-intro.pdf][pdf]]
* Midterm
** [[file:Assignments/Mock-Midterm/mock-midterm.zip][mock-midterm.zip]]
** [[file:Assignments/Midterm/midterm.zip][midterm.zip]]
* Final Project
** [[file:Assignments/Final-Project/final.org][landing page]]
