material.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-03 Thu 16:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Material</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Material</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org535eba0">Assignments</a></li>
<li><a href="#orgc24e7e2">Lectures</a></li>
<li><a href="#org0825ee4">Midterm</a></li>
<li><a href="#org6efad9a">Final Project</a></li>
</ul>
</div>
</div>
<div id="outline-container-org535eba0" class="outline-2">
<h2 id="org535eba0">Assignments</h2>
<div class="outline-text-2" id="text-org535eba0">
<ol class="org-ol">
<li><a href="Assignments/1-Assignment/hw1.html">html</a></li>
<li><a href="Assignments/2-Assignment/hw2.html">html</a></li>
<li><a href="Assignments/3-Assignment/hw3.html">html</a></li>
<li><a href="Assignments/4-Assignment/hw4.html">html</a></li>
<li><a href="Assignments/5-Assignment/hw5.html">html</a></li>
<li><a href="Assignments/6-Assignment/hw6.html">html</a></li>
<li><a href="Assignments/7-Assignment/hw7.html">html</a> <a href="Assignments/7-Assignment/assign7.zip">assign7.zip</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgc24e7e2" class="outline-2">
<h2 id="orgc24e7e2">Lectures</h2>
<div class="outline-text-2" id="text-orgc24e7e2">
</div>
<ul class="org-ul">
<li><a id="org6b32f59"></a>Course Introduction<br />
<ul class="org-ul">
<li><a id="orgb430c23"></a><a href="Slides/01-course-introduction.pdf">pdf</a> <a href="Code/01/swap.c">swap.c</a> <a href="Code/01/swap.rs">swap.rs</a><br /></li>
</ul>
</li>
<li><a id="org9361dd8"></a>The Basics<br />
<ul class="org-ul">
<li><a id="org2fd0364"></a><a href="Slides/02-the-basics.pdf">pdf</a> <a href="Slides/02-the-basics-392-annot.pdf">pdf (annotated)</a><br /></li>
</ul>
</li>
<li><a id="org07fd324"></a>The Stack and Heap<br />
<ul class="org-ul">
<li><a id="org40f9365"></a><a href="Slides/03-stack-and-heap.pdf">pdf</a> <a href="Slides/03-stack-and-heap-annot.pdf">pdf (annotated)</a><br /></li>
</ul>
</li>
<li><a id="org9cbdbb5"></a>References and Borrowing<br />
<ul class="org-ul">
<li><a id="org0625858"></a><a href="Slides/04-references-borrowing.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org66edcdd"></a>Structures and Enumerations<br />
<ul class="org-ul">
<li><a id="org442e53a"></a><a href="Slides/05-structs-enums.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org1bd25b2"></a>Collections<br />
<ul class="org-ul">
<li><a id="org758134e"></a><a href="Slides/06-collections.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="orga88603c"></a>Traits<br />
<ul class="org-ul">
<li><a id="org0131ac2"></a><a href="Slides/07-traits.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org11dcff7"></a>Closures and Iterators<br />
<ul class="org-ul">
<li><a id="orgabdbaec"></a><a href="Slides/08-closures.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org7c92c24"></a>Lifetimes<br />
<ul class="org-ul">
<li><a id="org9cf7b7a"></a><a href="Slides/09-lifetimes.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="orgc4815a8"></a>Boxes and Recursive Data<br />
<ul class="org-ul">
<li><a id="org4b3d2b0"></a><a href="Slides/10-boxes.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org19c1189"></a>Reference Counting and Internal Mutability<br />
<ul class="org-ul">
<li><a id="org7a1fef3"></a><a href="Slides/11-refs.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org54db103"></a>Concurrency<br />
<ul class="org-ul">
<li><a id="org57fd8b8"></a><a href="Slides/12-concurrency.pdf">pdf</a><br /></li>
</ul>
</li>
<li><a id="org47fb497"></a>Primer on Proof/Type Theory<br />
<ul class="org-ul">
<li><a id="org762519d"></a><a href="Slides/13-proof-theory.pdf">pdf</a> <a href="Slides/13-proof-theory-annotated.pdf">pdf (annotated)</a><br /></li>
</ul>
</li>
<li><a id="org8a88330"></a>Substructural Proof/Type Theory<br />
<ul class="org-ul">
<li><a id="orgae8b6a1"></a><a href="Slides/14-linear-types.pdf">pdf</a> <a href="Slides/14-linear-types-annotated.pdf">pdf (annotated)</a><br /></li>
</ul>
</li>
<li><a id="orgd83c67c"></a>Workshop: LTLC Interpreter<br />
<ul class="org-ul">
<li><a id="org6bb6bd5"></a><a href="Slides/15-stlc-workshop.pdf">pdf</a> <a href="Code/ltlc.zip">ltlc.zip</a><br /></li>
</ul>
</li>
<li><a id="org783062a"></a>Featherweight Rust: An Introduction<br />
<ul class="org-ul">
<li><a id="orge37782b"></a><a href="Slides/16-fr-intro.pdf">pdf</a><br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org0825ee4" class="outline-2">
<h2 id="org0825ee4">Midterm</h2>
<div class="outline-text-2" id="text-org0825ee4">
</div>
<ul class="org-ul">
<li><a id="org5a56db0"></a><a href="Assignments/Mock-Midterm/mock-midterm.zip">mock-midterm.zip</a><br /></li>
<li><a id="org805c959"></a><a href="Assignments/Midterm/midterm.zip">midterm.zip</a><br /></li>
</ul>
</div>
<div id="outline-container-org6efad9a" class="outline-2">
<h2 id="org6efad9a">Final Project</h2>
<div class="outline-text-2" id="text-org6efad9a">
</div>
<ul class="org-ul">
<li><a id="org460710c"></a><a href="Assignments/Final-Project/final.html">landing page</a><br /></li>
</ul>
</div>
</div>
</body>
</html>
